# MultiReferenceAnnotationOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationOptions Constructor
MultiReferenceAnnotationOptions Class See Also
---
Create an instance of Multi-Reference Annotation Options set with default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MultiReferenceAnnotationOptions(
	MultiReferenceAnnotationType multiReferenceAnnotationType
)
```

Visual Basic
---
```text
Public Sub New ( _
	multiReferenceAnnotationType As MultiReferenceAnnotationType _
)
```

Visual C++
---
```text
public:
MultiReferenceAnnotationOptions(
	MultiReferenceAnnotationType^ multiReferenceAnnotationType
)
```

# ### Parameters
multiReferenceAnnotationType
    Type: Autodesk.Revit.DB..::..MultiReferenceAnnotationType The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace